Repository: bfabio/publiccode.yml
Catalog: docs/locales/*/LC_MESSAGES/publiccode.yml.po
Languages: it

source: List of software categories
it: Lista delle categorie del software

source: Here follows a controlled vocabulary of useful tags for categorizing the software.
it: Qui di seguito è presentato un vocabolario controllato di tag utilizzabili per categorizzare il software.

source: Valid Tags
it: Tag Validi

source: Country-Specific Extensions
it: Estensioni nazionali

source: While the standard is structured to be meaningful on an international level, there are additional information that can be added that makes sense in specific countries, such as declaring compliance with local laws or regulations. The provided extension mechanism is the usage of country-specific sections.
it: Mentre il core è strutturato per essere significativo a livello internazionale, vi sono informazioni addizionali che possono essere aggiunte a livello nazionale, come ad esempio una dichiarazione di compatibilità con una legge locale. Il meccanismo di estensione fornito prevede l’utilizzo di sezioni specifiche per ogni Paese (*country-specific*).

source: All country-specific extensions are contained in a section named with the two-letter lowercase `ISO 3166-1 alpha-2 country code <https://it.wikipedia.org/wiki/ISO_3166-1_alpha-2>`__. For instance ``spid`` is a property for Italian software declaring whether the software is integrated with the Italian Public Identification System.
it: Tutte le sezioni specifiche per ogni Paese sono contenute in una sezione denominata con l’\ `ISO 3166-1 alpha-2 country code <https://it.wikipedia.org/wiki/ISO_3166-1_alpha-2>`__. Ad esempio, ``spid`` è una proprietà definita per i software italiani per la dichiarazione dell’eventuale compatibilità con il Sistema Pubblico di Identità Digitale.

source: If a software is compliant I will find:
it: Dunque, se un software è compatibile, troveremo:

source: Notice that country-specific extensions within international sections are not allowed. Countries that want to extend the format should add a country-specific section instead.
it: Nota bene che le chiavi *country-specific* **non** sono valide all’interno delle sezioni internazionali. I Paesi che vogliano estendere il formato devono aggiungere una sezione dedicata.

source: Italy
it: Italia

source: All the extensions listed below are specific for Italy and, as such, they must be inserted in a section named with the ``it`` code. Every Country is specified using a two letters *country code* following the ISO 3166-1 alpha-2 standard.
it: Tutte le estensioni elencate qui di seguito sono specifiche per l'Italia e, di conseguenza, devono essere inserite in una sezione denominata con il codice ``it``. Tutti i Paesi sono specificati usando *country code* a due lettere seguendo lo standard ISO 3166-1 alpha-2.

source: Key ``countryExtensionVersion``
it: Chiave ``countryExtensionVersion``

source: Type: string
it: Tipo: stringa

source: Presence: mandatory
it: Presenza: obbligatoria

source: Example: ``"1.0"``
it: Esempio: ``"1.0"``

source: This key specifies the version to which the current extension schema adheres to, for forward compatibility.
it: Questa chiave specifica la versione alla quale il presente schema di estensioni aderisce.

source: Please note how the value of this key is independent from the top-level ``publiccodeYmlVersion`` one (see :ref:`core`). In such a way, the extensions schema versioning is independent both from the core version of the schema and from every other Country.
it: **Nota Bene:** il valore di questa chiave è indipendente da quello contenuto nella chiave top-level ``publiccodeYmlVersion`` (vedi :ref:`core`). In questo modo, il versioning di ogni schema di estensioni è indipendente sia dalla versione core dello schema che da ogni altra estensione per Paese.

source: Key ``conforme``
it: Sezione ``conforme``

source: This section contains the keys for auto-declaring the compliance with the current legislation, with respect to the following sections. Not including these keys implies that the compliance is not known or not declared.
it: Questa sezione contiene delle chiavi per auto dichiarare la conformità con la normativa vigente, rispetto ad alcune sezioni. Se queste chiavi non vengono incluse, si intende che la conformità non è nota o non viene dichiarata.

source: Key ``conforme/lineeGuidaDesign``
it: Chiave ``conforme/lineeGuidaDesign``

source: Type: boolean
it: Tipo: booleano

source: Presence: optional
it: Presenza: opzionale

source: If present and set to ``yes``, the software is compliant with the Italian accessibility laws (L. 4/2004), as further explained in the `linee guida di design <https://docs.italia.it/italia/designers-italia/design-linee-guida-docs>`__ (Italian language).
it: Se presente e impostato a ``yes``, il software è conforme alle leggi in materia di accessibilità (L. 4/2004), come descritto ulteriormente nelle `linee guida di design <https://docs.italia.it/italia/designers-italia/design-linee-guida-docs>`__.

source: Key ``conforme/modelloInteroperatibilita``
it: Chiave ``conforme/modelloInteroperabilita``

source: If present and set to ``yes``, the software is compliant with the `linee guida sull’interoperabilità <https://docs.italia.it/italia/piano-triennale-ict/lg-modellointeroperabilita-docs>`__.
it: Se presente e impostato a ``yes``, il software è conforme alle `linee guida sull’interoperabilità <https://docs.italia.it/italia/piano-triennale-ict/lg-modellointeroperabilita-docs>`__.

source: Regulatory reference: `Art. 73 del CAD <https://docs.italia.it/italia/piano-triennale-ict/codice-amministrazione-digitale-docs/it/v2017-12-13/_rst/capo8_art73.html>`__ (Italian language).
it: Riferimento normativo: `Art. 73 del CAD <https://docs.italia.it/italia/piano-triennale-ict/codice-amministrazione-digitale-docs/it/v2017-12-13/_rst/capo8_art73.html>`__.

source: Key ``conforme/misureMinimeSicurezza``
it: Chiave ``conforme/misureMinimeSicurezza``

source: If present and set to ``yes``, the software is compliant with the `Misure minime di sicurezza ICT per le Pubbliche amministrazioni <http://www.agid.gov.it/sites/default/files/documentazione/misure_minime_di_sicurezza_v.1.0.pdf>`__ (Italian language).
it: Se presente e impostato a ``yes``, il software è conforme alle `Misure minime di sicurezza ICT per le Pubbliche amministrazioni <http://www.agid.gov.it/sites/default/files/documentazione/misure_minime_di_sicurezza_v.1.0.pdf>`__.

source: Key ``conforme/gdpr``
it: Chiave ``conforme/gdpr``

source: If present and set to ``yes``, the software respects the GDPR.
it: Se presente e impostato a ``yes``, il software rispetta il GDPR.

source: Section ``piattaforme``
it: Sezione ``piattaforme``

source: Key ``piattaforme/spid``
it: Chiave ``piattaforme/spid``

source: If present and set to ``yes``, the software interfaces with `SPID - il Sistema Pubblico di Identità Digitale <https://developers.italia.it/it/spid>`__.
it: Se presente e impostato a ``yes``, il software si interfaccia con `SPID - il Sistema Pubblico di Identità Digitale <https://developers.italia.it/it/spid>`__.

source: Key ``piattaforme/cie``
it: Chiave ``piattaforme/cie``

source: If present and set to ``yes``, the software interfaces with the Italian electronic ID card (``Carta di Identità Elettronica``).
it: Se presente e impostato a ``yes``, il software si interfaccia con la Carta di Identità Elettronica.

source: Key ``piattaforme/anpr``
it: Chiave ``piattaforme/anpr``

source: If present and set to ``yes``, the software interfaces with ANPR.
it: Se presente e impostato a ``yes``, il software si interfaccia con ANPR.

source: Key ``piattafome/pagopa``
it: Chiave ``piattaforme/pagopa``

source: If present and set to ``yes``, the software interfaces with pagoPA.
it: Se presente e impostato a ``yes``, il software si interfaccia con pagoPA.

source: Section ``riuso``
it: Sezione ``riuso``

source: This section contains a set of keys related to the publication of the software inside the reuse catalog of `Developers Italia <https://developers.italia.it>`__.
it: Questa sezione contiene una serie di chiavi legate alla pubblicazione del software sul `Catalogo del Riuso <https://developers.italia.it>`__.

source: Type: string (iPA code)
it: Tipo: stringa (codice iPA)

source: Presence: mandatory if ``repoOwner`` is a Public Administration
it: Presenza: obbligatoria se ``repoOwner`` è una Pubblica Amministrazione

source: Example: ``c_h501``
it: Esempio: ``c_h501``

source: This key represents the administration code inside the Public Administration index (codice IPA).
it: Questa chiave rappresenta il codice dell’amministrazione all’interno dell’Indice delle Pubbliche Amministrazioni (codice IPA).

source: Below there are two examples of `publiccode.yml` files, the first one represents the minimum configuration, which contains the mandatory fields, whilst the second one represents a more extended version.
it: Qui di seguito vi sono due esempi di file `publiccode.yml`, il primo rappresenta la configurazione minima, ovvero contiene i campi obbligatori, mentre il secondo è più esteso.

source: Minimum Version
it: Versione Minima

source: Extended Version
it: Versione Estesa

source: Forks and variants
it: Fork e varianti

source: As already cited before, a fork may have two different forms based on the final aim. As such, in order to make it clear how to handle the `publiccode.yml` in both cases, below we define two different semantics: technical forks and software variants.
it: Come già accennato precedentemente, il fork di un progetto software può essere inteso in modo diverso a seconda dello scopo finale di tale diramazione. Per questioni di chiarezza, qui di seguito distinguiamo le due possibilità: fork tecnici e varianti software.

source: Technical forks (i.e. to publish patches)
it: Fork tecnici (i.e. pubblicare patch)

source: A technical fork is a fork made by a developer for the purpose of working on the original code base or sending improvements to the original authors, without any explicit goal of creating and publishing an alternative variant of the original software.
it: Un fork tecnico è un fork eseguito da uno sviluppatore con lo scopo di lavorare sulla *code base* originale o per inviare miglioramenti agli autori del software originale, senza la finalità esplicita di creare e mantenere una variante alternativa del software originale.

source: In the context of distributed control systems and collaborative code hosting platforms like GitHub, forking is almost always used by developers as a step to work on a contribution on an existing codebase, by sending “pull requests”.
it: Nel contesto di un sistema di controllo distribuito e piattaforme di hosting di codice collaborative quali GitHub, lo strumento del *fork* è quasi sempre usato dagli sviluppatori come il primo passo per lavorare ad un contributo su una *code base* già esistente inviando *pull request*.

source: Because of the way forking works on GitHub and other platforms, developers publish their forks as perfect copies of the original software, thus including also ``publiccode.yml``. However, parsers need to be able to distinguish such technical forks from the original codebase.
it: Visto il modo in cui il sistema di *forking* funziona su GitHub ed altre piattaforme simili, gli sviluppatori pubblicano i propri fork sotto forma di copie perfette del software originale, quindi includendo anche il file ``publiccode.yml`` originale. I parser devono essere in grado di distinguere questi fork tecnici dalla *code base* originale.

source: Parsers
it: Parser

source: Parsers **SHOULD** identify a technical fork by noticing that the top-level ``url`` key does not point to the repository in which the ``publiccode.yml`` is found.
it: I *parser* **DOVREBBERO** identificare un fork tecnico notando che la chiave top-level ``url`` non punta al repository dove si trova il file ``publiccode.yml``.

source: Parsers **MIGHT** identify a technical fork also through metadata that might be exposed by the code hosting platform (eg: GitHub marks forks explicitly as forks)
it: I *parser* **POTREBBERO** identificare un fork tecnico anche attraverso i metadati che potrebbero essere esposti dalla piattaforma di code hosting (e.g., GitHub contrassegna i fork esplicitamente come fork).

source: Authors
it: Autori

source: Authors of technical forks **SHOULD NOT** modify ``publiccode.yml`` in any way. Specifically, they **MUST NOT** modify the top-level ``url`` key that **MUST** continue pointing to the original repository.
it: Gli autori di un fork tecnico **NON DOVREBBERO** modificare il file ``publiccode.yml`` in alcun modo. Più nello specifico, **NON DEVONO** modificare la chiave top-level ``url`` in quanto questa **DEVE** continuare a puntare al repository originale.

source: There is no explicit key to mark a fork as a technical fork. This is a conscious design decision because we do not want authors of technical forks to be aware of ``publiccode.yml`` and necessarily be aware of how to modify it. The current design does not require authors to do anything.
it: Non c’è una chiave specifica per contrassegnare un fork come tecnico. Questa è una scelta consapevole di design perché non vogliamo che gli autori di un fork tecnico debbano necessariamente essere consapevoli del file ``publiccode.yml`` e di come doverlo modificare. Il design corrente non richiede che questi autori facciano alcunché.

source: Software variants
it: Varianti software

source: A software variant is a fork that is offered as an alternative to the original upstream software.
it: Una variante software è un fork che rappresenta una valida alternativa al software originale upstream.

source: It contains modifications that are still not part of the upstream version, like more features, different dependencies, optimizations, etc.
it: Questa contiene modifiche che non sono ancora parte della versione upstream, come ad esempio più funzionalità, dipendenze diverse, ottimizzazioni, etc.

source: By marking a fork as a variant, the author indicates that they believe that the variant includes a complete and working set of modifications that might be useful to other people.
it: Contrassegnando un fork come una variante, l’autore indica che questa variante include una serie di modifiche complete e funzionanti che potrebbero giovare ad altre persone.

source: Marking a fork as a variant does **not** relate to the willingness of contributing upstream; the author might still plan to contribute the modifications upstream, or even being in the process of doing so. Thus, even if the fork will eventually be merged upstream, it might make sense to mark it as a variant during the process, so that others might discover it and benefit from it.
it: Contrassegnare un fork come una variante **non** pregiudica la volontà di contribuire upstream; l’autore potrebbe comunque voler contribuire upstream o essere in attesa di farlo. Perciò, anche se il fork alla fine verrà inclusa (merge) upstream, potrebbe aver senso contrassegnarla come una variante durante queste fasi di lavoro intermedie, in modo tale che anche altri possano trovarla e beneficiarne.

source: Parsers **SHOULD** identify a variant by noticing that the top-level ``url`` key matches to the repository in which the ``publiccode.yml`` is found, **AND** a top-level ``isBasedOn`` exists and points to a different repository.
it: I parser **DOVREBBERO** identificare una variante notando che la chiave top-level ``url`` è uguale al repository nel quale il file ``publiccode.yml`` risiede, **E** una chiave top-level ``isBasedOn`` esiste e punta ad un altro repository.

source: Parsers should expect and analyze other differences in ``publiccode.yml`` between variants of the software. Specifically ``description/features`` is designed to be compared across variants to identify and show user-visible differences.
it: I parser dovrebbero aspettarsi e analizzare altre differenze nelle due varianti dei file ``publiccode.yml``. In particolare, la chiave ``description/features`` è pensata per essere comparata tra diverse varianti in modo da identificare e visualizzare le differenze lato utente.

source: Authors that are willing to publish a fork as a variant **MUST** at least:
it: Gli autori che vogliano pubblicare un fork come una variante **DEVONO** almeno:

source: add a key ``isBasedOn`` pointing to one or more upstream repositories from which this variant is derived.
it: aggiungere una chiave ``isBasedOn`` che punti a uno o più repository upstream dai quali questa variante deriva.

source: Change the value for ``url`` to point to the repository holding the variant.
it: Cambiare il valore di ``url`` per farla puntare al repository che ospita la variante.

source: Change the value for ``legal/repoOwner`` to refer to the themselves (the authors of the variant).
it: Cambiare il valore di ``legal/repoOwner`` per identificarsi come autori della variante.

source: Revisit the ``maintenance`` section to refer to the maintenance status of the variant.
it: Rivisitare la sezione denominata ``maintenance`` per aggiornare lo stato di manutenzione della variante.

source: Moreover, authors **SHOULD** evaluate the following changes:
it: Inoltre, gli autori **DOVREBBERO** valutare di apportare anche i seguenti cambiamenti:

source: add the features that differentiate the variant to the ``description/features`` key. Existing features **SHOULD NOT** be edited or removed from this list unless they have been removed from the variant, to allow parsers to easily compare feature lists.
it: aggiungere le funzionalità che differenziano le varianti alla chiave ``description/features``. Le funzionalità esistenti **NON DOVREBBERO** essere modificate o rimosse da questa lista a meno che esse siano state rimosse dalla variante, per permettere ai parser di comparare facilmente la lista delle funzionalità.

source: ``publiccode.yml`` is a metadata standard for repositories containing software developed or acquired by the Public Administration, aimed at making them easily discoverabile and thus reusable by other entities.
it: ``publiccode.yml`` è uno standard di metadati ideato per essere inserito in repository contenenti software della Pubblica Amministrazione con lo scopo di renderli facilmente individuabili e, di conseguenza, riutilizzabili da altri enti.

source: By including a ``publiccode.yml`` file in the root of a repository, and populating it with information about the software, technicians and civil servants can evaluate it. Automatic indexing tools can also be built, since the format is easily readable by both humans and machines.
it: Inserendo nella root di un repository un file chiamato ``publiccode.yml`` che descrive le caratteristiche del software se ne agevola la comprensione ai tecnici e ai decisori pubblici interessati a valutarlo; al tempo stesso si permette di costruire strumenti automatici di indicizzazione, poiché il formato è facilmente leggibile sia da esseri umani sia da macchine.

source: ``publiccode.yml`` is mandatory for all public software developed in Italy, according to the national `guidelines <https://docs.italia.it/AgID/linee-guida-riuso-software/lg-acquisizione-e-riuso-software-per-pa-docs/>`__: this enables the Developers Italia crawler to build the national `software catalog <https://developers.italia.it/>`__. The standard is designed to be interoperable internationally, thus the country-specific keys are separated by the core part and are defined in specific sections that each government can rule.
it: ``publiccode.yml`` è obbligatorio per tutto il software pubblico sviluppato in Italia, come da `linee guida <https://docs.italia.it/AgID/linee-guida-riuso-software/lg-acquisizione-e-riuso-software-per-pa-docs/>`__: questo consente al crawler automatico di Developers Italia di costituire il `catalogo del software a riuso <https://developers.italia.it/>`__. Lo standard è tuttavia pensato in ottica internazionale, per cui tutte le specificità nazionali sono separate dal core e definite in apposite sezioni estensibili autonomamente dai governi nazionali.

source: Details carried by a ``publiccode.yml`` file include:
it: Tra le informazioni contenute in un ``publiccode.yml`` vi sono:

source: title and description of the project or product (in one or more languages);
it: il titolo e la descrizione del progetto o prodotto (in una o più lingue);

source: development state (e.g., ``concept``, ``development``, ``beta``, ``stable``, ``obsolete``;
it: lo stato dello sviluppo ad es., ``concept``, ``development``, ``beta``, ``stable``, ``obsolete``;

source: contacts of the entity who published the codebase;
it: i riferimenti dell’organizzazione che ha sviluppato il progetto;

source: contacts of the maintainer, if any, including the expire date of the maintenance contract;
it: chi si sta occupando della sua manutenzione e quando il rapporto finirà;

source: information about the legal context for which the project or product was designed;
it: per quale quadro giuridico è stato pensato questo progetto o prodotto;

source: dependencies.
it: quali dipendenze software esistono.

source: and much more.
it: e molte altre informazioni rilevanti.

source: See also
it: Link utili

source: `More information about software reuse <https://developers.italia.it/en/reuse>`__
it: `Maggiori informazioni sul riuso del software <https://developers.italia.it/it/riuso>`__

source: `publiccode.yml web editor <https://publiccode-editor.developers.italia.it/>`__
it: `Editor web per publiccode.yml <https://publiccode-editor.developers.italia.it/>`__

source: Table of contents
it: Indice dei contenuti

source: The Standard (core)
it: Lo standard (core)

source: This document represents the description of the ``publiccode.yml`` schema.
it: La struttura di un file ``publiccode.yml`` prevede l'esistenza di chiavi top-level e sezioni che possono contenere al proprio interno altre chiavi. Lo standard ha rilevanza internazionale ma è possibile dichiarare una sezione dedicata per le chiavi relative ad un Paese specifico (si veda :ref:`estensioni-paese` per maggiori dettagli).

source: Top-Level Keys and Sections
it: Chiavi e Sezioni Top-Level

source: Key ``publiccodeYmlVersion``
it: Chiave ``publiccodeYmlVersion``

source: Example: ``"0.1"``
it: Esempio: ``"0.1"``

source: This key specifies the version to which the current ``publiccode.yml`` adheres to, for forward compatibility.
it: Questa chiave specifica la versione alla quale il presente ``publiccode.yml`` aderisce, per una questione di compatibilità diretta.

source: Key ``name``
it: Chiave ``name``

source: Example: ``"Medusa"``
it: Esempio: ``"Medusa"``

source: This key contains the name of the software. It contains the (short) public name of the product, which can be localised in the specific ``localisation`` section. It should be the name most people usually refer to the software. In case the software has both an internal “code” name and a commercial name, use the commercial name.
it: Questa chiave contiene il nome del software. Contiene il nome (abbreviato) pubblico del prodotto, che può essere tradotto nella sezione specifica chiamata ``localisation``. Dovrebbe essere il nome con il quale la maggior parte delle persone si riferisce al suddetto software. Nel caso in cui il software abbia sia un nome in “codice” interno che uno commerciale, è preferibile usare il nome commerciale.

source: Key ``applicationSuite``
it: Chiave ``applicationSuite``

source: Example: ``"MegaProductivitySuite"``
it: Esempio: ``"MegaProductivitySuite"``

source: This key contains the name of the “suite” to which the software belongs.
it: Questa chiave contiene il nome della “suite” alla quale il software appartiene.

source: Key ``url``
it: Chiave ``url``

source: Type: string (URL)
it: Tipo: stringa (URL)
