Repository: bfabio/publiccode.yml
Catalog: docs/locales/*/LC_MESSAGES/publiccode.yml.po
Languages: it

source: ``email`` - This key contains the e-mail address of the technical contact. It must be an email address of where the technical contact can be directly reached; do NOT populate this key with mailing-lists or generic contact points like “info@acme.inc”. The e-mail address must not be obfuscated. To improve resistance against e-mail collection, use ``\x64`` to replace ``@``, as allowed by the YAML specification.
it: ``email`` - Questa chiave contiene l’indirizzo email del contatto tecnico. Deve essere un indirizzo email per il contatto diretto con il tecnico; NON popolare questa chiave con mailing-list o punti di contatto generico tipo “info@acme.inc”. Questo indirizzo email non deve essere offuscato. Per migliorare la resistenza contro la raccolta di indirizzi email, usare ``\x64`` per sostituire ``@``, siccome questo è permesso dalle specifiche YAML.

source: ``phone`` - phone number (with international prefix). This has to be a string.
it: ``phone`` - Numero telefonico (con prefisso internazionale). Questa chiave deve essere una stringa.

source: ``affiliation`` - This key contains an explicit affiliation information for the technical contact. In case of multiple maintainers, this can be used to create a relation between each technical contact and each maintainer entity. It can contain for instance a company name, an association name, etc.
it: ``affiliation`` - Questa chiave contiene informazioni esplicite sui contatti tecnici. Nel caso esistano diversi maintainer, questa chiave può essere usata per creare relazioni tra diversi contatti tecnici e entità di manutenzione. Ad esempio, può contenere il nome di un’azienda, il nome di un’associazione, etc.

source: A Contractor is an object with the following properties:
it: Un Contractor è un oggetto con le seguenti proprietà:

source: ``name`` - **mandatory** - The name of the contractor, whether it’s a company or a physical person.
it: ``name`` - **obbligatoria** - Il nome del contractor, sia esso un’azienda o una persona fisica.

source: ``until`` - **mandatory** - This is a date (YYYY-MM-DD). This key must contain the date at which the maintenance is going to end. In case of community maintenance, the value should not be more than 2 years in the future, and thus will need to be regularly updated as the community continues working on the project.
it: ``until`` - **obbligatoria** - Questa è una data (YYYY-MM-DD). Questa chiave deve contenere una data alla quale la manutenzione finirà. Nel caso di manutenzione gestita dalla community, questo valore non deve essere maggiore di 2 anni nel futuro, e quindi deve essere regolarmente aggiornata man mano che la community continua a lavorare al progetto.

source: ``website`` - This key points to the maintainer website. It can either point to the main institutional website, or to a more project-specific page or website.
it: ``website`` - Questa chiave punta al sito del maintainer. Può puntare al principale sito istituzionale, o ad una pagina o sito più specifica.

source: Dates
it: Date

source: Encoding
it: Codifica

source: `publiccode.yml` **MUST** be UTF-8 encoded.
it: La codifica di ``publiccode.yml`` **DEVE** essere UTF-8.

source: Scope list
it: Lista dei campi di applicazione
