Repository: bfabio/publiccode.yml
Catalog: docs/locales/*/LC_MESSAGES/publiccode.yml.po
Languages: it

source: Example: ``"https://example.com/italia/medusa.git"``
it: Esempio: ``"https://example.com/italia/medusa.git"``

source: A unique identifier for this software. This string must be a URL to the source code repository (git, svn, …) in which the software is published. If the repository is available under multiple protocols, prefer HTTP/HTTPS URLs which don’t require user authentication.
it: Un identificatore unico per questo software. Questa stringa deve essere una URL che punta al repository di codice sorgente (git, svn, …) nel quale il software è pubblicato. Se il repository è disponibile sotto diversi protocolli, preferire URL HTTP/HTTPS che non richiedono l’autenticazione.

source: Forks created for the purpose of contributing upstream should not modify this file; this helps software parsing ``publiccode.yml`` to immediately skip technical forks. On the contrary, a complete fork that is meant to be maintained separately from the original software should modify this line, to give themselves the status of a different project.
it: I fork creati con lo scopo di contribuire *upstream* non devono modificare questo file; questo aiuta i software che fanno il parsing di ``publiccode.yml`` a saltare immediatamente i fork tecnici. Al contrario, un fork completo che sarà manutenuto in modo separato rispetto al software originale, dovrebbe modificare questa linea per essere trattato come una variante distinta.

source: See :ref:`forks-and-variants` for a complete description of what is a software variant and how to handle forked software as a parser or an author.
it: Vedi :ref:`fork-varianti` per una descrizione completa del significato di variante software e di come gestire i fork sia lato parser che lato autore.

source: Key ``landingURL``
it: Chiave ``landingURL``

source: Example: ``"https://example.com/italia/medusa"``
it: Esempio: ``"https://example.com/italia/medusa"``

source: If the ``url`` parameter does not serve a human readable or browsable page, but only serves source code to a source control client, with this key you have an option to specify a landing page. This page, ideally, is where your users will land when they will click a button labeled something like “Go to the application source code”. In case the product provides an automated graphical installer, this URL can point to a page which contains a reference to the source code but also offers the download of such an installer.
it: Se la chiave ``url`` non porta ad una pagina leggibile da un umano, ma serve solo ad indirizzare un client di source control verso il codice sorgente, con questa chiave viene introdotta l’opzione di specificare la *landing page*. Questa pagina, idealmente, è il punto di arrivo dell’utente quando seleziona un pulsante chiamato, ad esempio, “Vai al codice sorgente dell’applicazione”. Nel caso in cui il prodotto preveda un installer grafico automatico, questa URL può puntare alla pagina contenente un riferimento al codice sorgente ma che offra anche la possibilità di scaricare tale installer.

source: Key ``isBasedOn``
it: Chiave ``isBasedOn``

source: Type: string or array of strings
it: Tipo: stringa o array di stringhe

source: Example: ``"https://github.com/italia/otello.git"``
it: Esempio: ``"https://github.com/italia/otello.git"``

source: In case this software is a variant or a fork of another software, which might or might not contain a ``publiccode.yml`` file, this key will contain the ``url`` of the original project(s).
it: Nel caso in cui questo software sia una variante o un fork di un altro software, che opzionalmente può contenere un file ``publiccode.yml``, questa chiave conterrà la ``url`` di uno o più progetti originali.

source: The existence of this key identifies the fork as a software variant, descending from the specified repositories.
it: L’esistenza di questa chiave identifica il fork come una variante (vedi :ref:`fork-varianti`), discendente dal repository specificato.

source: Key ``softwareVersion``
it: Chiave ``softwareVersion``

source: Example: ``"1.0"``, ``"dev"``
it: Esempio: ``"1.0"``, ``"dev"``

source: This key contains the latest stable version number of the software. The version number is a string that is not meant to be interpreted and parsed but just displayed; parsers should not assume semantic versioning or any other specific version format.
it: Questa chiave contiene il numero dell’ultima versione stabile del software. Il numero di versione è una stringa che non è pensata per essere interpretata dal parser ma solamente visualizzata; i parser non devono assumere l’utilizzo del semantic versioning o altri specifici formati di versionamento.

source: The key can be omitted if the software is currently in initial development and has never been released yet.
it: Questa chiave può essere omessa nel caso in cui il software sia in una fase iniziale di sviluppo e non sia stato ancora rilasciato.

source: Key ``releaseDate``
it: Chiave ``releaseDate``

source: Type: string (date)
it: Tipo: stringa (data)

source: Example: ``"2017-04-15"``
it: Esempio: ``"2017-04-15"``

source: This key contains the date at which the latest version was released. This date is mandatory if the software has been released at least once and thus the version number is present.
it: Questa chiave contiene la data di ultimo rilascio del software. Questa data è obbligatoria se il software è stato rilasciato almeno una volta e dunque esiste un numero di versione.

source: Key ``logo``
it: Chiave ``logo``

source: Type: string (relative path to file or absolute URL)
it: Tipo: stringa (percorso verso il file)

source: Acceptable formats: SVG, SVGZ, PNG
it: Formati accettabili: SVG, SVGZ, PNG

source: Example: ``"img/logo.svg"``
it: Esempio: ``"img/logo.svg"``

source: This key contains the path to the logo of the software. Logos should be in vector format; raster formats are only allowed as a fallback. In this case, they should be transparent PNGs, minimum 1000px of width. The key value can be the relative path to the file starting from the root of the repository, or it can be an absolute URL pointing to the logo in raw version. In both cases, the file must reside inside the same repository where the ``publiccode.yml`` file is stored.
it: Questa chiave indica il logo del software. Il valore può essere il percorso relativo al file a partire dalla root del repository, oppure una URL assoluta che punta al logo in versione raw. In entrambi i casi, il file deve risiedere all'interno del medesimo repository che contiene il ``publiccode.yml``. Il logo dovrebbe essere in formato vettoriale; i formati raster sono solo accettabili come fallback. In questo caso, dovrebbero essere PNG trasparenti, con una larghezza minima di 1000px.

source: Key ``monochromeLogo``
it: Chiave ``monochromeLogo``

source: Type: string (path to file)
it: Tipo: stringa (percorso verso il file)

source: Example: ``"img/logo-mono.svg"``
it: Presenza: opzionaleEsempio: ``"img/logo-mono.svg"``

source: A monochromatic (black) logo. The logo should be in vector format; raster formats are only allowed as a fallback. In this case, they should be transparent PNGs, minimum 1000px of width. The key value can be the relative path to the file starting from the root of the repository, or it can be an absolute URL pointing to the logo in raw version. In both cases, the file must reside inside the same repository where the ``publiccode.yml`` file is stored.
it: Questa chiave indica il logo monocromatico (nero) del software. Il valore può essere il percorso relativo al file a partire dalla root del repository, oppure una URL assoluta che punta al logo in versione raw. In entrambi i casi, il file deve risiedere all'interno del medesimo repository che contiene il ``publiccode.yml``. Il logo dovrebbe essere in formato vettoriale; i formati raster sono solo accettabili come fallback. In questo caso, dovrebbero essere PNG trasparenti, con una larghezza minima di 1000px.

source: Key ``inputTypes``
it: Chiave ``inputTypes``

source: Type: array of enumerated strings
it: Tipo: array di stringhe

source: Values: as per RFC 6838
it: Valori: vedi RFC 6838

source: Example: ``"text/plain"``
it: Esempio: ``"text/plain"``

source: A list of Media Types (MIME Types) as mandated in `RFC 6838 <https://tools.ietf.org/html/rfc6838>`__ which the application can handle as input.
it: Una lista di Media Types (MIME Types), come specificato dal `RFC 6838 <https://tools.ietf.org/html/rfc6838>`__, che possono essere gestiti in input dall’applicazione.

source: In case the software does not support any input, you can skip this field or use ``application/x.empty``.
it: Nel caso in cui il software non supporti alcun input, è possibile saltare questo campo o usare ``application/x.empty``.

source: Key ``outputTypes``
it: Chiave ``outputTypes``

source: A list of Media Types (MIME Types) as mandated in `RFC 6838 <https://tools.ietf.org/html/rfc6838>`__ which the application can handle as output.
it: Una lista di Media Types (MIME Types), come specificato dal `RFC 6838 <https://tools.ietf.org/html/rfc6838>`__, che possono essere gestiti in output dall’applicazione.

source: In case the software does not support any output, you can skip this field or use ``application/x.empty``.
it: Nel caso in cui il software non supporti alcun output, è possibile saltare questo campo o usare ``application/x.empty``.

source: Key ``platforms``
it: Chiave ``platforms``

source: Type: enumerated string or array of strings
it: Tipo: stringhe o array di stringhe

source: Values: ``web``, ``windows``, ``mac``, ``linux``, ``ios``, ``android``. Human readable values outside this list are allowed.
it: Valori: ``web``, ``windows``, ``mac``, ``linux``, ``ios``, ``android``. Valori leggibili da un umano al di fuori di questa lista sono permessi.

source: Example: ``web``
it: Esempio: ``web``

source: This key specifies which platform the software runs on. It is meant to describe the platforms that users will use to access and operate the software, rather than the platform the software itself runs on.
it: Questa chiave specifica su quale piattaforma funziona il software. È pensata per descrivere le piattaforme che l’utente userà per accedere ed utilizzare il software, piuttosto che la piattaforma sul quale il software gira.

source: Use the predefined values if possible. If the software runs on a platform for which a predefined value is not available, a different value can be used.
it: Se possibile, usare i valori predefiniti. Se il software gira su una piattaforma per la quale un valore predefinito non è disponibile, un diverso valore può essere usato.

source: Key ``categories``
it: Chiave ``categories``

source: Type: array of strings
it: Tipo: array di stringhe

source: Acceptable values: see :ref:`categories-list`
it: Valori accettabili: vedi :ref:`categories-list`

source: A list of words that can be used to describe the software and can help building catalogs of open software.
it: Una lista di parole che possono essere usate per descrivere il software e possono aiutare a costruire il catalogo di software open.

source: The controlled vocabulary :ref:`categories-list` contains the list of allowed values.
it: Il vocabolario controllato :ref:`categories-list` presenta la lista dei valori accettabili.

source: Key ``usedBy``
it: Chiave ``usedBy``

source: A list of the names of prominent public administrations (that will serve as “testimonials”) that are currently known to the software maintainer to be using this software.
it: Una lista di nome di prominenti Pubbliche Amministrazioni (che serviranno come “testimonial”) che il maintainer riconosce come utilizzatori attuali di questo software.

source: Parsers are encouraged to enhance this list also with other information that can obtain independently; for instance, a fork of a software, owned by an administration, could be used as a signal of usage of the software.
it: I parser sono incoraggiati ad accrescere questa lista anche con altre informazioni che riescono ad ottenere in modo indipendente; ad esempio, il fork di un software, di proprietà di un’amministrazione, può essere usato come un segnale di uso del software.

source: Key ``roadmap``
it: Chiave ``roadmap``

source: A link to a public roadmap of the software.
it: Un link ad una *roadmap* pubblica del software.

source: Key ``developmentStatus``
it: Chiave ``developmentStatus``

source: Type: enumerated string
it: Tipo: stringa

source: Allowed values: ``concept``, ``development``, ``beta``, ``stable``, ``obsolete``
it: Valori permessi: ``concept``, ``development``, ``beta``, ``stable``, ``obsolete``

source: The keys are:
it: Le chiavi sono:

source: ``concept`` - The software is just a “concept”. No actual code may have been produced, and the repository could simply be a placeholder.
it: ``concept`` - Il software è solo un “concept”. Non è stato sviluppato codice e il repository potrebbe semplicemente essere un placeholder.

source: ``development`` - Some effort has gone into the development of the software, but the code is not ready for the end user, even in a preliminary version (beta or alpha) to be tested by end users.
it: ``development`` - Qualche sforzo è stato fatto in direzione dello sviluppo del software ma il codice non è pronto per l’utenza finale, nemmeno in una versione preliminare (beta o alpha) per essere testato dall’utenza.

source: ``beta`` - The software is in the testing phase (alpha or beta). At this stage, the software might or might not have had a preliminary public release.
it: ``beta`` - Il software è in fase di testing (alpha o beta). In questo stage, il software potrebbe aver o non aver ancora avuto una release pubblica preliminare.

source: ``stable`` - The software has seen a first public release and is ready to be used in a production environment.
it: ``stable`` - Il software ha già avuto una prima release pubblica ed è pronto per essere usato in un contesto di produzione.

source: ``obsolete`` - The software is no longer maintained or kept up to date. All of the source code is archived and kept for historical reasons.
it: ``obsolete`` - Il software non è più manutenuto o aggiornato. Tutto il codice sorgente è archiviato e tenuto per ragioni di storico.

source: Key ``softwareType``
it: Chiave ``softwareType``

source: Allowed values: ``"standalone/mobile"``, ``"standalone/iot"``, ``"standalone/desktop"``, ``"standalone/web"``, ``"standalone/backend"``, ``"standalone/other"``, ``"addon"``, ``"library"``, ``"configurationFiles"``
it: Valori permessi: ``"standalone/mobile"``, ``"standalone/iot"``, ``"standalone/desktop"``, ``"standalone/web"``, ``"standalone/backend"``, ``"standalone/other"``, ``"addon"``, ``"library"``, ``"configurationFiles"``

source: ``standalone/mobile`` - The software is a standalone, self-contained The software is a native mobile app.
it: ``standalone/mobile`` - Il software è un pacchetto *self-contained*, *standalone*. Il software è un'applicazione nativa per dispositivi mobile.

source: ``standalone/iot`` - The software is suitable for an IoT context.
it: ``standalone/iot`` - Il software è adatto ad essere utilizzato nel contesto `Internet of Things`.

source: ``standalone/desktop`` - The software is typically installed and run in a a desktop operating system environment.
it: ``standalone/desktop`` - Il software è tipicamente installato e utilizzato su un sistema operativo desktop.

source: ``standalone/web`` - The software represents a web application usable by means of a browser.
it: ``standalone/web`` - Il software rappresenta un applicativo fruibile attraverso il web.

source: ``standalone/backend`` - The software is a backend application.
it: ``standalone/backend`` - Il software è un applicativo backend.

source: ``standalone/other`` - The software has a different nature from the once listed above.
it: ``standalone/other`` - Il software ha una natura diversa rispetto a quanto specificato alle chiavi precedenti.

source: ``softwareAddon`` - The software is an addon, such as a plugin or a theme, for a more complex software (e.g. a CMS or an office suite).
it: ``softwareAddon`` - Il software è un *addon*, come ad esempio un plugin o un tema, per un software più complesso (e.g., un CMS o una suite per ufficio).

source: ``library`` - The software contains a library or an SDK to make it easier to third party developers to create new products.
it: ``library`` - Il software contiene una libreria o una SDK che facilita la creazione di nuovi prodotti a sviluppatori di terze parti.

source: ``configurationFiles`` - The software does not contain executable script but a set of configuration files. They may document how to obtain a certain deployment. They could be in the form of plain configuration files, bash scripts, ansible playbooks, Dockerfiles, or other instruction sets.
it: ``configurationFiles`` - Il software non contiene script eseguibili ma una serie di file di configurazione. Questi potrebbero documentare come ottenere un certo tipo di *deployment*. I suddetti file potrebbero avere la forma di semplici file di configurazione, script bash, playbook ansible, Dockerfile, o altri set di istruzioni.

source: Section ``intendedAudience``
it: Sezione ``intendedAudience``

source: Key ``intendedAudience/countries``
it: Chiave ``intendedAudience/countries``

source: This key explicitly includes certain countries in the intended audience, i.e. the software explicitly claims compliance with specific processes, technologies or laws. All countries are specified using lowercase ISO 3166-1 alpha-2 two-letter country codes.
it: Questa chiave include in modo esplicito alcuni Paesi tra il pubblico previsto, i.e., il software rivendica esplicitamente la conformità con processi specifici, tecnologie o leggi. Tutti i Paesi sono specificati usando *country code* a due lettere seguendo lo standard ISO 3166-1 alpha-2.

source: Key ``intendedAudience/unsupportedCountries``
it: Chiave ``intendedAudience/unsupportedCountries``

source: This key explicitly marks countries as NOT supported. This might be the case if there is a conflict between how software is working and a specific law, process or technology. All countries are specified using lowercase ISO 3166-1 alpha-2 two-letter country codes.
it: Questa chiave contrassegna esplicitamente i Paesi **NON** supportati. Questa situazione potrebbe verificarsi nel momento in cui esista un conflitto tra la modalità di funzionamento del software ed una legge specifica, un processo o una tecnologia. Tutti i Paesi sono specificati usando *country code* a due lettere seguendo lo standard ISO 3166-1 alpha-2.

source: Key ``intendedAudience/scope``
it: Chiave ``intendedAudience/scope``

source: Acceptable values: see :ref:`scope-list`
it: Valori accettabili: vedi :ref:`scope-list`

source: This key contains a list of tags related to the field of application of the software.
it: Questa chiave contiene una lista di tag che rappresentano il campo di applicazione del software.

source: Section ``description``
it: Sezione ``description``

source: This section contains a general description of the software. Parsers can use this section for instance to create a web page describing the software.
it: Questa sezione contiene una descrizione generale del software. I parser possono usare questa sezione ad esempio per creare una pagina web che descriva il software.

source: **Note:** since all the strings contained in this section are user-visible and written in a specific language, you **must** specify the language you are editing the text in (using the IETF `BCP 47 <https://tools.ietf.org/html/bcp47>`__ specifications) by creating a sub-section with that name. The primary language subtag cannot be omitted, as mandated by the BCP 47.
it: **Nota bene:** siccome tutte le stringhe contenute in questa sezione sono visibili all’utente e scritte in un linguaggio specifico, è **necessario** specificare il linguaggio con il quale si sta modificando il testo. Per farlo è necessario creare una sezione dedicata alla lingua seguendo le specifiche IETF `BCP 47 <https://tools.ietf.org/html/bcp47>`__. Si ricorda che il *primary language subtag* non può essere omesso, come specificato nel BCP 47.

source: An example for English:
it: Un esempio per l’italiano:

source: description: en: shortDescription: ... longDescription: ...
it: description: it: shortDescription: ... longDescription: ...

source: In the following part of the document, all keys are assumed to be in a sub-section with the name of the language (we will note this with ``[lang]``).
it: Nelle parti successive del documento, tutte le chiavi sono assunte essere all’interno di una sezione con il nome della lingua (annoteremo questo con ``[lang]``).

source: **Note:** it is mandatory to have *at least* one language in this section. All other languages are optional.
it: **Nota bene:** è obbligatorio avere *almeno* una lingua in questa sezione. Tutte le altre lingue sono opzionali.

source: Key ``description/[lang]/localisedName``
it: Chiave ``description/[lang]/localisedName``

source: This key is an opportunity to localise the name in a specific language. It contains the (short) public name of the product. It should be the name most people usually refer to the software. In case the software has both an internal “code” name and a commercial name, use the commercial name.
it: Questa chiave rappresenta un’opportunità di tradurre il nome in una lingua specifica. Contiene il nome pubblico (corto) del prodotto. Dovrebbe essere il nome con il quale la maggioranza delle persone normalmente si riferisce al software. Nel caso in cui il software abbia sia un nome “interno” che uno commerciale, è preferibile utilizzare quello commerciale.

source: Key ``description/[lang]/genericName``
it: Chiave ``description/[lang]/genericName``

source: Type: string (max 35 chars)
it: Tipo: stringa (max 35 caratteri)

source: Example: ``"Text Editor"``
it: Esempio: ``"Text Editor"``

source: This key is the “Generic name”, which refers to the specific category to which the software belongs. You can usually find the generic name in the presentation of the software, when you write: “Software xxx is a yyy”. Notable examples include “Text Editor”, “Word Processor”, “Web Browser”, “Chat” and so on… The generic name can be up to 35 characters long.
it: Questa chiave rappresenta il “Nome generico”, riferito alla categoria specifica alla quale il software appartiene. Normalmente è possibile trovare il nome generico nella presentazione del software, quando si scrive una frase del tipo: “Il software xxx è un yyy”. Esempi degni di nota includono “Editor di Testi”, “Word Processor”, “Web Browser”, “Chat” e così via. Il nome generico può avere una lunghezza fino a 35 caratteri.

source: Key ``description/[lang]/shortDescription``
it: Chiave ``description/[lang]/shortDescription``

source: Type: string (max 150 chars)
it: Tipo: stringa (max 150 caratteri)

source: Example: ``"Advanced booking system for hospitals"``
it: Esempio: ``"Sistema avanzato di prenotazione per ospedali"``

source: This key contains a short description of the software. It should be a single line containing a single sentence. Maximum 150 characters are allowed.
it: Questa chiave contiene una breve descrizione del software. Dovrebbe essere una singola linea contenente una singola frase. L’estensione massima consentita è di 150 caratteri.

source: Key ``description/[lang]/longDescription``
it: Chiave ``description/[lang]/longDescription``

source: Type: string (min 500 chars, max 10000 chars)
it: Tipo: stringa (min 500 caratteri, max 10000 caratteri)

source: Presence: mandatory (for at least one language)
it: Presenza: obbligatoria (almeno per una lingua)
