Repository: bfabio/publiccode.yml
Catalog: docs/locales/*/LC_MESSAGES/publiccode.yml.po
Languages: it

source: This key contains a longer description of the software, between 500 and 10000 chars. It is meant to provide an overview of the capabilities of the software for a potential user. The audience for this text should be that of users of the software, not developers. You can think of this text as the description of the software that would be in its website (if the software had one).
it: Questa chiave contiene una descrizione più lunga del software, con una lunghezza che può variare da 500 a 1000 caratteri. Questa chiave è pensata per fornire una panoramica delle caratteristiche del software per un potenziale utente. Il destinatario di questo testo dovrebbe essere l’utente finale, non nello sviluppatore. E’ possibile pensare a questo testo come alla descrizione del software che potrebbe stare nel sito web (nel caso in cui il software ne possieda uno).

source: This description can contain some basic markdown: ``*italic*``, ``**bold**``, bullet points and ``[links](#)``.
it: Questa descrizione può contenere del Markdown base: ``*italic*``, ``**bold**``, elenchi puntati e ``[link](#)``.

source: Key ``description/[lang]/documentation``
it: Chiave ``description/[lang]/documentation``

source: Type: URL
it: Tipo: URL

source: This key contains a reference to the user-level (not developer-level) documentation of the software. The value must be a URL to a hosted version of the documentation.
it: Questa chiave contiene un riferimento alla documentazione lato utente (non lato sviluppatore) Questo valore deve essere una URL che punta ad una versione ospitata della documentazione.

source: It is suggested that the URL points to a hosted version of the documentation that is immediately readable through a common web browser in both desktop and mobile format. The documentation should be rendered in HTML and browsable like a website (with a navigation index, a search bar, etc.).
it: È suggerito che questa URL punti ad una versione ospitata della documentazione che sia direttamente leggibile utilizzando un comune web browser sia in formato desktop che mobile. La documentazione dovrebbe essere renderizzata in HTML e navigabile come un sito web (con un indice, una barra di ricerca, etc.).

source: If the documentation is instead available only as a document, put a direct view/download link as URL in this key. You should commit the document as part of the source code repository, and then link to it using the code hosting source browser URL (e.g.: GitHub URL to the file). Prefer using open formats like PDF or ODT for maximum interoperability.
it: Se la documentazione dovesse invece essere disponibile esclusivamente sotto forma di documento, è possibile inserire il link diretto per vedere/scaricare tale documento, sotto forma di URL, in questa chiave. E’ consigliabile trattare la documentazione come parte del codice sorgente e dunque gestirla tramite commit sul repository del codice sorgente. In questo modo, sarà possibile fornire una URL diretta alla piattaforma di hosting del codice (ad es., GitHub URL al file). E’ preferibile utilizzare formati aperti quali PDF o ODT per avere la massima interoperabilità.

source: Whichever the format for the documentation, remember to make its source files available under an open license, possibly by committing them as part of the repository itself.
it: Qualunque sia il formato della documentazione, è importante ricordare di rilasciarne i sorgenti coperti da licenza aperta, possibilmente effettuandone un commit all’interno del repository stesso.

source: Key ``description/[lang]/apiDocumentation``
it: Chiave ``description/[lang]/apiDocumentation``

source: This key contains a reference to the API documentation of the software. The value must be a URL to a hosted version of the documentation.
it: Questa chiave contiene un riferimento alla documentazione delle API del software. Il valore deve essere una URL verso una versione ospitata della documentazione.

source: It is suggested that the URL points to a hosted version of the documentation that is immediately readable through a common web browser. The documentation should be rendered in HTML and browsable like a website (with a navigation index, a search bar, etc.), and if there is a reference or test deployment, possibly offer an interactive interface (e.g. Swagger).
it: E’ suggerito che questa URL punti ad una versione ospitata della documentazione che sia direttamente leggibile utilizzando un comune web browser. La documentazione dovrebbe essere renderizzata in HTML e navigabile come un sito web (con un indice, una barra di ricerca, etc.), e se c’è un riferimento ad un deployment di prova, questo dovrebbe offrire un’interfaccia navigabile (e.g. Swagger).

source: Key ``description/[lang]/features``
it: Chiave ``description/[lang]/features``

source: This key contains a list of software features, describing what capabilities the software allows to do. The audience for this text should be that of public decision makers who will be commissioning the software. The features should thus not target developers; instead of listing technical features referring to implementation details, prefer listing user-visible functionalities of the software.
it: Questa chiave contiene una lista di *feature* del software, che descriva le possibilità offerte dallo stesso. Il target di questo testo sono i decisori pubblici che potranno decidere di adottarlo o modificarlo. Per questo motivo, queste feature *non* devono riferirsi agli sviluppatori: invece di elencare le caratteristiche tecniche riferite ai dettagli implementativi, è preferibile elencare le funzionalità lato utente.

source: While the key is mandatory, there is no mandatory minimum or maximum number of features that should be listed in this key. Each feature must use a maximum of 100 characters.
it: Anche se questa chiave è obbligatoria, non c’è un limite minimo o massimo sul numero di feature da elencare in questa chiave. Ogni feature deve però avere un massimo di 100 caratteri.

source: The suggested number of features to list is between 5 and 20, depending on the software size and complexity. There is no need for exhaustiveness, as users can always read the documentation for additional information.
it: Il numero di feature suggerito da elencare è tra 5 e 20, a seconda della dimensione del software e della sua complessità. Non c’è bisogno di fare una lista esaustiva, dal momento che gli utenti hanno sempre a disposizione la documentazione per reperire ulteriori informazioni.

source: Key ``description/[lang]/screenshots``
it: Chiave ``description/[lang]/screenshots``

source: Type: array of strings (paths)
it: Tipo: array di stringhe (percorsi)

source: Formats: PNG, JPG
it: Formati: PNG, JPG

source: Example: ``"data/screenshots/configuration.png"``
it: Esempio: ``"data/screenshots/configuration.png"``

source: This key contains one or multiple paths to files showing screenshots of the software. They are meant to give a quick idea on how the software looks like and how it works. The key value can be the relative path to the file starting from the root of the repository, or it can be an absolute URL pointing to the screenshot in raw version. In both cases, the file must reside inside the same repository where the ``publiccode.yml`` file is stored.
it: Questa chiave indica una o più immagini del software (screenshot). Queste hanno lo scopo di dare una panoramica dell'aspetto del software e del suo funzionamento. Il valore può essere il percorso relativo al file a partire dalla root del repository, oppure una URL assoluta che punta all'immagine in versione raw. In entrambi i casi, il file deve risiedere all'interno del medesimo repository che contiene il ``publiccode.yml``.

source: Screenshots can be of any shape and size; the suggested formats are:
it: Queste immagini possono essere di qualsiasi formato e dimensione; i formati suggeriti sono:

source: Key ``description/[lang]/videos``
it: Chiave ``description/[lang]/videos``

source: Type: array of strings (URLs)
it: Tipo: array di stringhe (URL)

source: Example: ``"https://youtube.com/xxxxxxxx"``
it: Esempio: ``"https://youtube.com/xxxxxxxx"``

source: This key contains one or multiple URLs of videos showing how the software works. Like screenshots, videos should be used to give a quick overview on how the software looks like and how it works. Videos must be hosted on a video sharing website that supports the `oEmbed <https://oembed.com>`__ standard; popular options are YouTube and Vimeo.
it: Questa chiave contiene una o più URL di video che mostrano il funzionamento del software. Così come gli screenshot, i video dovrebbero essere usati per dare una rapida panoramica sull’aspetto e le funzionalità del software. I video devono essere ospitati su una piattaforma di video sharing che supporti lo standard `oEmbed <https://oembed.com>`__; le opzioni più popolari sono YouTube e Vimeo.

source: Since videos are an integral part of the documentation, it is recommended to publish them with an open license.
it: **Nota bene:** dal momento che costituisce parte integrante della documentazione, è opportuno che il video sia pubblicato con una licenza aperta.

source: Key ``description/[lang]/awards``
it: Chiave ``description/[lang]/awards``

source: A list of awards won by the software.
it: Una lista di premi assegnati al software.

source: Section ``legal``
it: Sezione ``legal``

source: Key ``legal/license``
it: Chiave ``legal/license``

source: Example: ``"AGPL-3.0-or-later"``
it: Esempio: ``"AGPL-3.0-or-later"``

source: This string describes the license under which the software is distributed. The string must contain a valid SPDX expression, referring to one (or multiple) open-source license. Please refer to the `SPDX documentation <https://spdx.org/licenses/>`__ for further information.
it: Questa stringa descrive la licenza con cui il software è distribuito. La stringa deve contenere un’espressione SPDX valida che si riferisca ad una (o più) licenze open-source. Per avere ulteriori informazioni a riguardo è possibile visitare la `documentazione SPDX <https://spdx.org/licenses/>`__.

source: Key ``legal/mainCopyrightOwner``
it: Chiave ``legal/mainCopyrightOwner``

source: Example: ``"City of Amsterdam"``
it: Esempio: ``"Città di Roma"``

source: This string describes the entity that owns the copyright on “most” of the code in the repository. Normally, this is the line that is reported with the copyright symbol at the top of most files in the repo.
it: Questa stringa descrive l’entità che possiede il copyright sulla maggior parte del codice presente nel repository. Normalmente, questa è la linea che viene riportata con il simbolo di copyright all’inizio della maggior parte dei file nel repository.

source: It is possible to list multiple owners if required so, using an English sentence. It is also possible to informally refer to a community of group of people like “Linus Torvalds and all Linux contributors”.
it: E’ possibile elencare diversi proprietari se necessario, usando una frase in inglese. E’ anche possibile riferirsi ad una community o ad un gruppo di persone come ad esempio “Linus Torvalds and all Linux contributors”.

source: In case it is not possible to name a main copyright owner, it is possible to omit this key; in those cases, if the repo has a authors file, you can point to it through ``legal/authorsFile``.
it: Nel caso in cui non sia possibile individuare il maggior proprietario di copyright, è possibile omettere questa chiave; in questi casi, se il repository ha un file contenente il nome degli autori, è possibile puntare a quel file attraverso ``legal/authorsFile`` (vedi più sotto).

source: Key ``legal/repoOwner``
it: Chiave ``legal/repoOwner``

source: This string describes the entity that owns this repository; this might or might not be the same entity who owns the copyright on the code itself. For instance, in case of a fork of the original software, the ``repoOwner`` is probably different from the ``mainCopyrightOwner``.
it: Questa stringa descrive l’entità che possiede il repository; questa può essere o non essere la stessa che possiede il copyright del codice stesso. Ad esempio, nel caso di un fork del software originale, il ``repoOwner`` è probabilmente diverso dal ``mainCopyrightOwner``.

source: Key ``legal/authorsFile``
it: Chiave ``legal/authorsFile``

source: Example: ``"doc/AUTHORS.txt"``
it: Esempio: ``"doc/AUTHORS.txt"``

source: Some open-source software adopt a convention of identify the copyright holders through a file that lists all the entities that own the copyright. This is common in projects strongly backed by a community where there are many external contributors and no clear single/main copyright owner. In such cases, this key can be used to refer to the authors file, using a path relative to the root of the repository.
it: Qualche software open-source adotta una convenzione che identifica il detentore del copyright attraverso un file elencante tutte le entità che possiedono il copyright. Questo è comune nei progetti fortemente sostenuti dalla community ove esistono diversi contributori esterni e non c’è un chiaro singolo detentore del copyright. In questi casi, questa chiave può essere usata per riferirsi al suddetto file degli autori, usando un percorso relativo alla radice (root) del repository.

source: Section ``maintenance``
it: Sezione ``maintenance``

source: This section provides information on the maintenance status of the software, useful to evaluate whether the software is actively developed or not.
it: Questa sezione fornisce informazioni sullo stato di manutenzione del software, utile per valutare se il software è attivamente sviluppato o meno.

source: Key ``maintenance/type``
it: Chiave ``maintenance/type``

source: Type: enumerate
it: Tipo: enumerate

source: Values: ``"internal"``, ``"contract"``, ``"community"``, ``"none"``
it: Valori: ``"internal"``, ``"contract"``, ``"community"``, ``"none"``

source: This key describes how the software is currently maintained.
it: Questa chiave descrive come il software è attualmente manutenuto.

source: ``internal`` - means that the software is internally maintained by the repository owner;
it: ``internal`` - significa che il software è manutenuto internamente dal proprietario del repository;

source: ``contract`` - means that there is a commercial contract that binds an entity to the maintenance of the software;
it: ``contract`` - significa che c’è un contratto commerciale che lega un’entità alla manutenzione del software;

source: ``community`` - means that the software is currently maintained by one or more people that donate their time to the project;
it: ``community`` - significa che il software è attualmente manutenuto da una o più persone che offrono il loro tempo al progetto;

source: ``none`` - means that the software is not actively maintained.
it: ``none`` - significa che il software non è al momento manutenuto.

source: Key ``maintenance/contractors``
it: Chiave ``maintenance/contractors``

source: Type: array of Contractor (see below)
it: Tipo: array di Contractor (vedi sotto)

source: Presence: mandatory (if ``maintenance/type`` **is** ``contract``)
it: Presenza: obbligatoria (se ``maintenance/type`` **è** ``contract``)

source: This key describes the entity or entities, if any, that are currently contracted for maintaining the software. They can be companies, organizations, or other collective names.
it: Questa chiave descrive l’entità o le entità, se ce ne sono, che attualmente hanno un contratto di manutenzione del software. Queste possono essere aziende, organizzazioni o altri nomi collettivi.

source: Key ``maintenance/contacts``
it: Chiave ``maintenance/contacts``

source: Type: List of Contacts (see below)
it: Tipo: Lista di Contatti (vedi sotto)

source: Presence: mandatory (if ``maintenance/type`` **is** ``internal`` or ``community``)
it: Presenza: obbligatoria (se ``maintenance/type`` **è** ``internal`` oppure ``community``)

source: One or more contacts maintaining this software.
it: Uno o più contatti di chi sta mantenendo il software.

source: This key describes the technical people currently responsible for maintaining the software. All contacts need to be a physical person, not a company or an organisation. If somebody is acting as a representative of an institution, it must be listed within the ``affiliation`` of the contact.
it: Questa chiave descrive le persone tecniche che attualmente sono responsabili della manutenzione del software. Tutti i contatti devono essere di una persona fisica, non un’azienda o un’organizzazione. Se un contatto funge da rappresentante di un’istituzione, questo rapporto deve essere esplicitato attraverso la chiave ``affiliation``.

source: In case of a commercial agreement (or a chain of such agreements), specify the final entities actually contracted to deliver the maintenance. Do not specify the software owner unless it is technically involved with the maintenance of the product as well.
it: Nel caso di un accordo commerciale (o una catena di tali accordi), specificare le entità finali che sono effettivamente contrattate per fornire la manutenzione. Non specificare il proprietario del software a meno che sia tecnicamente coinvolto anche nella manutenzione del prodotto.

source: Section ``localisation``
it: Sezione ``localisation``

source: This section provides an overview of the localization features of the software.
it: Questa sezione fornisce una panoramica sulle funzionalità di localizzazione del software.

source: Key ``localisation/localisationReady``
it: Chiave ``localisation/localisationReady``

source: If ``yes``, the software has infrastructure in place or is otherwise designed to be multilingual. It does not need to be available in more than one language.
it: Se ``yes``, il software ha l’infrastruttura o è stato progettato per essere multi-lingua. Ad ogni modo, questo campo non pregiudica l’esistenza di una traduzione in altre lingue ma si riferisce esclusivamente all’aspetto tecnologico. Per l’elenco delle lingue disponibili si veda la chiave ``localisation/availableLanguages``.

source: Key ``localisation/availableLanguages``
it: Chiave ``localisation/availableLanguages``

source: Type: list of IETF BCP 47 language tags
it: Tipo: lista di *language tag* secondo le specifiche IETF BCP 47 - Presenza: obbligatoria

source: Example: ``"it"``, ``"en"``, ``"sl-IT-nedis"``
it: Esempio: ``"it"``, ``"en"``, ``"sl-IT-nedis"``

source: If present, this is the list of languages in which the software is available. Of course, this list will contain at least one language. The primary language subtag cannot be omitted, as mandated by the `BCP 47 <https://tools.ietf.org/html/bcp47>`__.
it: Se presente, questa è la lista di lingue in cui è disponibile il software. Ovviamente, questa lista dovrà contenere almeno una lingua. Si ricorda che il *primary language subtag* non può essere omesso, come specificato dal `BCP 47 <https://tools.ietf.org/html/bcp47>`__.

source: Section ``dependsOn``
it: Sezione ``dependsOn``

source: This section provides an overview on the system-level dependencies required to install and use this software.
it: Questa sezione fornisce una panoramica delle dipendenze a livello di sistema necessarie per installare ed utilizzare il software.

source: **NOTE:** do not list dependencies at the source code level (e.g.: software libraries being used), and focus only on runtime and/or system-level dependencies that must be installed and maintained separately. For instance, a database is a good example of such dependencies.
it: **Nota bene:** non elencare le dipendenze a livello di codice sorgente (ad es., librerie software usate), e focalizza solo su dipendenze di sistema e/o a runtime che devono essere installate e manutenute separatamente. Ad esempio, un database è un buon esempio di questo tipo di dipendenza.

source: Key ``dependsOn/open``
it: Chiave ``dependsOn/open``

source: Type: array of ``dependency`` (see below)
it: Tipo: array di ``dependency`` (vedi sotto)

source: This key contains a list of runtime dependencies that are distributed under an open-source license.
it: Questa chiave contiene una lista di dipendenze a runtime che sono distribuite con una licenza di tipo open-source.

source: Key ``dependsOn/proprietary``
it: Chiave ``dependsOn/proprietary``

source: This key contains a list of runtime dependencies that are distributed under a proprietary license.
it: Questa chiave contiene una lista di dipendenze a runtime che sono distribuite con una licenza proprietaria.

source: Key ``dependsOn/hardware``
it: Chiave ``dependsOn/hardware``

source: Special data formats
it: Formati di dato speciali

source: A ``dependency`` is a complex object. The properties are the following:
it: Una ``dependency`` è un oggetto complesso. Le proprietà sono le seguenti:

source: ``name`` - **mandatory** - The name of the dependency (e.g. MySQL, NFC Reader)
it: ``name`` - **obbligatoria** - Il nome della dipendenza (e.g. MySQL, NFC Reader);

source: ``versionMin`` - the first compatible version
it: ``versionMin`` - la prima versione compatibile;

source: ``versionMax`` - the latest compatible version
it: ``versionMax`` - l’ultima versione compatibile;

source: ``version`` - the only major version for which the software is compatible. It assumes compatibility with all patches and bugfixes later applied to this version.
it: ``version`` - l’unica versione major con la quale il software è compatibile. Si assume la compatibilità con tutte le *patch* e i *bugfix* che saranno applicati successivamente a questa versione;

source: ``optional`` - whether the dependency is optional or mandatory
it: ``opzionale`` - se la dipendenza è opzionale o obbligatoria.

source: Complex versioning
it: Versioning complesso

source: It is of course possible to use the various keys to specify a complex compatibility matrix.
it: E’ ovviamente possibile utilizzare le varie chiavi per specificare una matrice di compatibilità complessa.

source: This snippet marks an optional dependency on PostgreSQL exactly version 3.2.
it: Questo snippet segnala una dipendenza opzionale verso PostgreSQL, nell’esattezza la sua versione 3.2.

source: This snippet marks a mandatory dependency on MySQL, allowing any version between 1.1 and 1.3.
it: Questo snippet segnala una dipendenza obbligatoria verso MySQL, permettendo ogni versione tra la 1.1 e la 1.3.

source: Contact
it: Contatto

source: A Contact is an object with the following properties:
it: Un Contatto è un oggetto con le seguenti proprietà:

source: ``name`` - **mandatory** - This key contains the full name of one of the technical contacts. It must be a real person; do NOT populate this key with generic contact information, company departments, associations, etc.
it: ``name`` - **obbligatoria** - Questa chiave contiene il nome completo di uno dei contatti tecnici. Deve essere una persona reale; NON popolare questa chiave con informazioni di contatto generiche, dipartimenti dell’azienda, associazioni, etc.
